edges = [
    ("Термінал 1", "Склад 1", 25),
    ("Термінал 1", "Склад 2", 20),
    ("Термінал 1", "Склад 3", 15),
    ("Термінал 2", "Склад 3", 15),
    ("Термінал 2", "Склад 4", 30),
    ("Термінал 2", "Склад 2", 10),
    ("Склад 1", "Магазин 1", 15),
    ("Склад 1", "Магазин 2", 10),
    ("Склад 1", "Магазин 3", 20),
    ("Склад 2", "Магазин 4", 15),
    ("Склад 2", "Магазин 5", 10),
    ("Склад 2", "Магазин 6", 25),
    ("Склад 3", "Магазин 7", 20),
    ("Склад 3", "Магазин 8", 15),
    ("Склад 3", "Магазин 9", 10),
    ("Склад 4", "Магазин 10", 20),
    ("Склад 4", "Магазин 11", 10),
    ("Склад 4", "Магазин 12", 15),
    ("Склад 4", "Магазин 13", 5),
    ("Склад 4", "Магазин 14", 10),
]

positions = {
    "Термінал 1": (1, 2),
    "Термінал 2": (5, 2),
    "Склад 1": (2, 3),
    "Склад 2": (4, 3),
    "Склад 3": (2, 1),
    "Склад 4": (4, 1),
    "Магазин 1": (0, 4),
    "Магазин 2": (1, 4),
    "Магазин 3": (2, 4),
    "Магазин 4": (3, 4),
    "Магазин 5": (4, 4),
    "Магазин 6": (5, 4),
    "Магазин 7": (0, 0),
    "Магазин 8": (1, 0),
    "Магазин 9": (2, 0),
    "Магазин 10": (3, 0),
    "Магазин 11": (4, 0),
    "Магазин 12": (5, 0),
    "Магазин 13": (6, 0),
    "Магазин 14": (7, 0),
}

labels = [
    "Термінал 1",
    "Термінал 2",
    "Склад 1",
    "Склад 2",
    "Склад 3",
    "Склад 4",
    "Магазин 1",
    "Магазин 2",
    "Магазин 3",
    "Магазин 4",
    "Магазин 5",
    "Магазин 6",
    "Магазин 7",
    "Магазин 8",
    "Магазин 9",
    "Магазин 10",
    "Магазин 11",
    "Магазин 12",
    "Магазин 13",
    "Магазин 14"
]

sources = [
    "Термінал 1",
    "Термінал 2"
]

sinks = [
    "Магазин 1",
    "Магазин 2",
    "Магазин 3",
    "Магазин 4",
    "Магазин 5",
    "Магазин 6",
    "Магазин 7",
    "Магазин 8",
    "Магазин 9",
    "Магазин 10",
    "Магазин 11",
    "Магазин 12",
    "Магазин 13",
    "Магазин 14"
]

warehouses_sinks = [
    "Склад 1",
    "Склад 2",
    "Склад 3",
    "Склад 4"
]